In [1]:
import pandas as pd

In [2]:
df1 = pd.DataFrame()

In [3]:
type(df1)

pandas.core.frame.DataFrame

In [4]:
print(df1)

Empty DataFrame
Columns: []
Index: []

In [5]:
df1

Empty DataFrame
Columns: []
Index: []

In [6]:
df.1 colums

SyntaxError: invalid syntax (1850845284.py, line 1)

In [7]:
df1 columns

SyntaxError: invalid syntax (18335966.py, line 1)

In [8]:
df1.columns

RangeIndex(start=0, stop=0, step=1)

In [9]:
df1.index

RangeIndex(start=0, stop=0, step=1)

In [10]:
students_list = [['Bob','William',26,'Computer Engineering',86],
                ['Emma','Johnson',23,'Math',92],
                ['Sarah','Smith',22,'Chemistry',95],
                ['Alex','Brown',21,'Electrical Engineering',82]]

In [11]:
students_df = pd.DataFrame(students_list)

In [12]:
students_df

       0        1   2                       3   4
0    Bob  William  26    Computer Engineering  86
1   Emma  Johnson  23                    Math  92
2  Sarah    Smith  22               Chemistry  95
3   Alex    Brown  21  Electrical Engineering  82

In [13]:
students_df = pd.DataFrame(students_list,colums=['First_Name','Last_Name','Age','Major','Score'])

TypeError: DataFrame.__init__() got an unexpected keyword argument 'colums'

In [14]:
students_df = pd.DataFrame(students_list,columns=['First_Name','Last_Name','Age','Major','Score'])

In [15]:
studens_df

NameError: name 'studens_df' is not defined

In [16]:
students_df

  First_Name Last_Name  Age                   Major  Score
0        Bob   William   26    Computer Engineering     86
1       Emma   Johnson   23                    Math     92
2      Sarah     Smith   22               Chemistry     95
3       Alex     Brown   21  Electrical Engineering     82

In [ ]:
students_df = pd.DataFrame(students_list,columns=['First_Name','Last_Name','Age','Major','Score'],
                          index = ['bob@mail.com','emma@mail.com','Sarah@mail.com','Alex@mail.com'])